---
kind: other
id: Properties.T:Autodesk.Revit.DB.KeyBasedTreeEntryTable
source: html/9728a5ff-0f8a-5aba-c71c-51e3ccea7e7f.htm
---
# KeyBasedTreeEntryTable Properties

The id of the assembly instance to which the element belongs.